package org.mirrentools.gateway.console.common;

/**
 * 状态码与状态信息的枚举类
 * 
 * @author Mirren
 *
 */
public enum ResultCodeEnum {
	/**
	 * 成功
	 */
	C200(200, "成功！"),
	/**
	 * 操作正常但没有任何改变
	 */
	C201(201, "操作正常但没有任何改变"),
	/**
	 * 部分成功,部分失败
	 */
	C202(202, "部分成功,部分失败"),
	/**
	 * 请进行下一步操作
	 */
	C203(203, "请进行下一步操作"),
	/**
	 * 用户注册人数已满无法再继续注册
	 */
	C299(299, "用户注册人数已满无法再继续注册"),
	/**
	 * 用户未登陆
	 */
	C300(300, "用户未登陆"),
	/**
	 * 被封禁的用户
	 */
	C301(301, "被封禁的用户"),
	/**
	 * 用户未注册
	 */
	C302(302, "用户未注册"),
	/**
	 * 用户已注册
	 */
	C303(303, "用户已注册"),
	/**
	 * 手机号或密码错误
	 */
	C304(304, "手机号或密码错误"),
	/**
	 * 对不起,该号码尚未注册
	 */
	C305(305, "对不起,该号码尚未注册"),
	/**
	 * 手机已注册
	 */
	C306(306, "手机已注册"),
	/**
	 * 验证码发送失败
	 */
	C307(307, "验证码发送失败"),
	/**
	 * 验证码已经失效,请重新获取验证码!
	 */
	C308(308, "验证码已经失效,请重新获取验证码!"),
	/**
	 * 验证码错误!
	 */
	C309(309, "验证码错误!"),
	/**
	 * 短信平台异常
	 */
	C310(310, "发短信无法暂时无法使用,请稍后重试！"),
	/**
	 * 发送短信失败,一个手机号码一天只能接收10条短信！
	 */
	C311(311, "发送短信失败,一个手机号码一天只能接收10条短信！"),
	/**
	 * 未授权或者权限过期
	 */
	C313(313, "未授权或者权限过期"),
	/**
	 * 非法操作或没有权限
	 */
	C314(314, "非法操作或没有权限"),
	/**
	 * IP被限制
	 */
	C315(315, "IP被限制"),

	/**
	 * 已超过登录有效期,请重新登录!
	 */
	C401(401, "已超过登录有效期,请重新登录!"),
	/**
	 * 非法操作或没有权限！
	 */
	C402(402, "非法操作或没有权限！"),
	/**
	 * 无效的URL请求,或者指定URL不存在
	 */
	C404(404, "无效的URL请求,或者指定URL不存在"),
	/**
	 * 对象只能读取
	 */
	C406(406, "对象只能读取"),
	/**
	 * 对不起！您请求的数据不存在！
	 */
	C407(407, "对不起！您请求的数据不存在！"),
	/**
	 * 请求超时
	 */
	C408(408, "请求超时"),

	/**
	 * 你的数据中缺少了必填的参数，或者你输入的数据存在空值！
	 */
	C412(412, "你的数据中缺少了必填的参数，或者你输入的数据存在空值！"),
	/**
	 * 参数值不符合规定范围
	 */
	C413(413, "参数值不符合规定范围"),
	/**
	 * 你请求的数据不符合规定的范围！
	 */
	C414(414, "你请求的数据不符合规定的范围！"),
	/**
	 * 与存储的数据不匹配
	 */
	C415(415, "与存储的数据不匹配"),
	/**
	 * 频繁操作
	 */
	C416(416, "频繁操作"),
	/**
	 * HTTP重复请求
	 */
	C431(431, "HTTP重复请求"),
	/**
	 * 参数中带有敏感或违法的词语
	 */
	C444(444, "参数中带有敏感或违法的词语"),

	/**
	 * 操作失败，请稍后重试！
	 */
	C500(500, "操作失败，请稍后重试！"),

	// 服务器错误
	/**
	 * [服务器]运行时异常
	 */
	C1000(1000, "[服务器]运行时异常"),
	/**
	 * [服务器]空值异常
	 */
	C1001(1001, "[服务器]空值异常"),
	/**
	 * [服务器]数据类型转换异常
	 */
	C1002(1002, "[服务器]数据类型转换异常"),
	/**
	 * [服务器]IO异常
	 */
	C1003(1003, "[服务器]IO异常"),
	/**
	 * 
	 */
	C1004(1004, "[服务器]未知方法异常"),
	/**
	 * [服务器]未知方法异常
	 */
	C1005(1005, "[服务器]数组越界异常"),
	/**
	 * [服务器]网络异常
	 */
	C1006(1006, "[服务器]网络异常"),

	/**
	 * [服务器]Bad Request
	 */
	C1400(1400, "[服务器]Bad Request"),
	/**
	 * [服务器]NotAuthorization
	 */
	C1401(1401, "[服务器]NotAuthorization"),
	/**
	 * [服务器]Method Not Allowed 检查请求方式是否有错
	 */
	C1405(1405, "[服务器]Method Not Allowed 检查请求方式是否有错"),
	/**
	 * [服务器]Not Acceptable
	 */
	C1406(1406, "[服务器]Not Acceptable"),
	/**
	 * [服务器限流]流量限制
	 */
	C1416(1416, "[服务器限流]流量限制"),

	/**
	 * [服务器]Internal Server Error
	 */
	C1500(1500, "[服务器]Internal Server Error"),
	/**
	 * [服务器]缓存异常
	 */
	C1505(1505, "[服务器]缓存异常");
	// 状态码
	private int code;
	private String msg;

	ResultCodeEnum(int code, String msg) {
		this.msg = msg;
		this.code = code;
	}

	/**
	 * 得到状态码
	 * 
	 * @return
	 */
	public int getCode() {
		return code;
	}

	/**
	 * 获得状态码相应的信息
	 * 
	 * @return
	 */
	public String getMsg() {
		return msg;
	}

}
